{
  "en": {
    "plates": "plates",
    "register/login": "register/login",
    "latest": "latest",
    "best": "best",
    "worst": "worst",
    "username": "username",
    "password": "password",
    "register": "register",
    "asguest": "as guest",
    "login": "login",
    "tos": "Terms of Service",
    "tosdesc": "1. Acceptance of Terms\nBy accessing and using this website, you accept and agree to be bound by the terms and provisions of this agreement.\n\n2. User Conduct\nUsers are responsible for the content they post. Any illegal activities, harassment, or offensive behavior are strictly prohibited.\n\n3. Privacy\nWe respect your privacy and are committed to protecting it. We store following data: your username, hashed password, IP address, device name, claimed plates, added comments and images, voting. You have the option to erase your account at any moment, and all your associated data will be removed accordingly.\n\n4. Liability\nWe are not responsible for any user-generated content or actions that take place through this website. Users must not upload or share any photos that violate the General Data Protection Regulation (GDPR). This includes, but is not limited to, photos that: contain images of individuals who have not given their explicit consent for their likeness to be shared publicly. Contain sensitive personal data as defined by the GDPR.\n\n5. Termination\nWe reserve the right to terminate access to our site for any reason, without notice.",
    "uniquepass": "unique password for you",
    "appdesc": "‣ Search, comment and rate plates.\n\n‣ Claim plates as your own and set custom message for visitors.",
    "passdesc": "We highly recommend using unique password in our app. We generated one just for you - use it on next screen while registering.",
    "usernameplaceholder": "your name",
    "commentplaceholder": "add comment",
    "allowedurls": "Allowed url links are: youtube, imgur, streamable.",
    "deleteconfirmation": "Do you want to delete this comment?",
    "reportconfirmation": "Do you want to report this comment?",
    "hideconfirmation": "Do you want to hide this comment?",
    "novinanddateerror": "VIN and register date are mandatory",
    "claimdesc": "You can claim plate as your own. It will be then visible in your profile. You will also be able to add short description below the plate - you can place there your contact details or link to sell car. Data you provide below will be stored only for approval process, then it will be deleted from the database.",
    "registerdate": "register date",
    "sendforapproval": "send for approval",
    "yes": "yes",
    "cancel": "cancel",
    "searchplaceholder": "search",
    "descsaved": "description saved",
    "adddesc": "add description",
    "comments": "comments",
    "delete": "delete",
    "report": "report",
    "hide": "hide",
    "gohome": "go home",
    "usernotfound": "user not found",
    "withus": "with us from",
    "owner": "owner",
    "settings": "settings",
    "role": "role",
    "toggledark": "toggle dark theme",
    "seemyprofile": "see my profile",
    "deletetoken": "deleting token will log you out from all devices",
    "deletemyacc": "delete my account",
    "deletemyacctoggle": "are you sure you want to do this? this cannot be undone",
    "deletemyaccdesc": "Do you want to delete your account? It cannot be undone. It will delete all your comments and images you uploaded.",
    "logout": "logout"
  },
  "pl": {
    "plates": "blachy",
    "register/login": "zarejestruj/zaloguj",
    "latest": "ostatnie",
    "best": "najlepsze",
    "worst": "najgorsze",
    "username": "imię",
    "password": "hasło",
    "register": "zarejestruj",
    "asguest": "jako gość",
    "login": "zaloguj",
    "tos": "warunki użytkowania",
    "tosdesc": "1. Akceptacja Warunków\nUzyskując dostęp do tej witryny i korzystając z niej, akceptujesz i zgadzasz się na niniejszej warunki.\n\n2. Postępowanie użytkownika\nUżytkownicy są odpowiedzialni za publikowane przez siebie treści. Wszelkie nielegalne działania, nękanie lub obraźliwe zachowanie są surowo zabronione.\n\n3. Prywatność\nSzanujemy Twoją prywatność i staramy się ją chronić. Przechowujemy następujące dane: Twoją nazwę użytkownika, zaszyfrowane hasło, adres IP, nazwę urządzenia, zajęte tablice, dodane komentarze i zdjęcia, oddane głosy. W każdej chwili masz możliwość usunięcia swojego konta, wraz ze wszystkimi powiązanymi z nim danymi.\n\n4. Odpowiedzialność\nNie ponosimy odpowiedzialności za treści generowane przez użytkowników ani działania podejmowane za pośrednictwem tej witryny. Użytkownikom nie wolno przesyłać ani udostępniać żadnych zdjęć naruszających Ogólne rozporządzenie o ochronie danych (RODO). Obejmuje to między innymi zdjęcia, które: zawierają wizerunki osób, które nie wyraziły zgody na publiczne udostępnianie ich wizerunku. Zawierają wrażliwe dane osobowe w rozumieniu RODO.\n\n5. Zakończenie\nZastrzegamy sobie prawo do zakończenia dostępu do naszej witryny z dowolnego powodu, bez uprzedzenia.",
    "uniquepass": "unikalne hasło dla Ciebie",
    "appdesc": "‣ Szukaj, oceniaj i komentuj blachy.\n\n‣ Zajmuj tablice i ustaw krótką wiadomość dla odwiedzających.",
    "passdesc": "Zdecydowanie zalecamy używanie unikalnego hasła w naszej apce. Wygenerowaliśmy takie dla Ciebie - skopiuj je i użyj na następnej stronie",
    "usernameplaceholder": "podaj imię niech się nie dziwię",
    "commentplaceholder": "dodaj komentarz i uzupełnij inwentarz",
    "allowedurls": "Dozwolone linki do serwisów: youtube, imgur, streamable.",
    "deleteconfirmation": "Czy chcesz usunąć ten komentarz?",
    "reportconfirmation": "Czy chcesz zgłosić ten komentarz?",
    "hideconfirmation": "Czy chcesz ukryć ten komentarz?",
    "novinanddateerror": "VIN and register date are mandatory",
    "claimdesc": "Możesz zająć tę tablicę. Będzie ona wtedy widoczna w Twoim profilu. Będziesz miał możliwość dodania krótkiego tekstu pod tablicą. Możesz tam umieścić swoje dane kontaktowe, link do ogłoszenia lub inny tekst. Dane które podasz poniżej będą przechowywane tylko na czas weryfikacji, potem zostaną usunięte z bazy.",
    "registerdate": "data rejestracji",
    "sendforapproval": "wyślij do weryfikacji",
    "yes": "tak",
    "cancel": "anuluj",
    "searchplaceholder": "przeszukaj bazę wpisując frazę",
    "descsaved": "opis zapisany",
    "adddesc": "dodaj opis",
    "comments": "komentarze",
    "delete": "usuń",
    "report": "zgłoś",
    "hide": "ukryj",
    "gohome": "powrót",
    "usernotfound": "nie znaleziono użytkownika",
    "withus": "z nami od",
    "owner": "właściciel",
    "settings": "ustawienia",
    "role": "ranga",
    "toggledark": "motyw ciemny",
    "seemyprofile": "zobacz mój profil",
    "deletetoken": "usunięcie tokenu wyloguje Cię ze wszystkich urządzeń",
    "deletemyacc": "usuń moje konto",
    "deletemyacctoggle": "na pewno chcesz to zrobić? usunięcie konta jest nieodwracalne",
    "deletemyaccdesc": "Chcesz usunąć swoje konto? Usunięcie konta jest nieodwracalne. Usunie to wszystkie Twoje komentarze i dodane zdjęcia.",
    "logout": "wyloguj"
  }
}